bc-cms/pro/Tanova/Services/TanovaEngine.php

select `l`.`id`, `lt`.`name`, `l`.`tanova_zones` from `bc_locations` as `l` inner join `bc_location_translations` as `lt` on `lt`.`origin_id` = `l`.`id` and `lt`.`locale` = 'en' where `l`.`tanova_zones` is not null and `l`.`tanova_zones` > 0 order by `lt`.`name` asc
---
    public function getPlaces(): array
    {
        return DB::table('bc_locations as l')
            ->join('bc_location_translations as lt', function ($j) {
                $j->on('lt.origin_id', '=', 'l.id')->where('lt.locale', 'en');
            })
            ->whereNotNull('l.tanova_zones')
            ->where('l.tanova_zones', '>', 0)
            ->select('l.id', 'lt.name', 'l.tanova_zones')
            ->orderBy('lt.name')
            ->get()
            ->map(fn($r) => (array)$r)
            ->toArray();

select `l`.`id`, `lt`.`name`, `l`.`tanova_zones` from `bc_locations` as `l` inner join `bc_location_translations` as `lt` on `lt`.`origin_id` = `l`.`id` and `lt`.`locale` = 'en' where `l`.`id` = 10 limit 1
---
    public function generate(array $params): ?array
    {
        $locationId = (int)   ($params['location_id'] ?? $params['place_id'] ?? 0);
        $startStr   = $params['start_date'] ?? '';
        $endStr     = $params['end_date']   ?? '';
        $guests     = max(1, (int)($params['guests'] ?? 2));
        $budget     = (float)($params['budget'] ?? 2000);
        $stayType   = $params['stay_type'] ?? null;
        $vendorId   = (int)   ($params['vendor_id'] ?? 0);
        if ($stayType === '') $stayType = null;

        if (!$locationId || !$startStr || !$endStr) return null;

        $loc = DB::table('bc_locations as l')
            ->join('bc_location_translations as lt', function ($j) {
                $j->on('lt.origin_id', '=', 'l.id')->where('lt.locale', 'en');
            })
            ->where('l.id', $locationId)
            ->select('l.id', 'lt.name', 'l.tanova_zones')
            ->first();

select `address` from `bc_tanova_accommodations` where `location_id` = 10 and `status` = 'publish' and `address` is not null
---

        // Hotel areas for restaurant proximity context
        $coords     = self::PLACE_COORDS[$locationId] ?? null;
        $hotelAreas = DB::table('bc_tanova_accommodations')
            ->where('location_id', $locationId)
            ->where('status', 'publish')
            ->whereNotNull('address')
            ->pluck('address')
            ->map(fn($a) => trim(explode(',', $a)[0]))
            ->unique()->values()->toArray();