bc-cms/modules/Tour/Controllers/ManageTourController.php

    public function manageTour(Request $request)
    {
        $this->checkPermission('tour_view');
        $user_id = Auth::id();
        [$list_tour, $fb, $perPage] = $this->manageFilters($request, $this->tourClass::where("author_id", $user_id), ['table' => 'bc_tours', 'noun' => __('tours'), 'status' => true, 'price' => true, 'category' => ['table'=>'bc_tour_category']]);
---
select * from `bc_tours` where `author_id` = 7 and `bc_tours`.`deleted_at` is null order by `id` desc limit 20 offset 0
select count(*) as aggregate from `bc_tours` where `author_id` = 7 and `bc_tours`.`deleted_at` is null

    public function editTour(Request $request, $id)
    {
        $this->checkPermission('tour_update');
        $user_id = Auth::id();
        $row = $this->tourClass::where("author_id", $user_id);
        $row = $row->find($id);
        if (empty($row)) {
            return redirect(route('tour.vendor.index'))->with('warning', __('Tour not found!'));
        }
        $translation = $row->translate($request->query('lang'));
        $data = [
            'translation'    => $translation,
            'row'            => $row,
            'tour_category'  => $this->tourCategoryClass::where("status", "publish")->get()->toTree(),
            'tour_location'  => $this->locationClass::where("status", "publish")->get()->toTree(),
            'location_category'=>$this->locationCategoryClass::where("status", "publish")->get(),
            'attributes'     => $this->attributesClass::where('service', 'tour')->get(),
---
select * from `bc_tours` where `author_id` = 9 and `bc_tours`.`id` = '423' and `bc_tours`.`deleted_at` is null limit 1
select * from `bc_tour_category` where `status` = 'publish' and `bc_tour_category`.`deleted_at` is null
select * from `bc_locations` where `status` = 'publish' and `bc_locations`.`deleted_at` is null
select * from `location_category` where `status` = 'publish' and `location_category`.`deleted_at` is null
select * from `bc_attrs` where `service` = 'tour' and `bc_attrs`.`deleted_at` is null