bc-cms/app/Providers/FortifyServiceProvider.php

        });

        Fortify::authenticateUsing(function (Request $request) {
            $user = User::where('email', $request->email)->first();
---
select * from `users` where `email` = 'sales@dare2traveladvetures.com' and `users`.`deleted_at` is null limit 1