bc-cms/modules/Booking/Models/Booking.php

    public static function getRecentBookings($limit = 10,$vendor_id = false)
    {
        $q = parent::where('status', '!=', 'draft');
        if(!empty($vendor_id)){
            $q->where('vendor_id', $vendor_id);
        }
        return $q->orderBy('id', 'desc')->limit($limit)->get();
---
select * from `bc_bookings` where `status` != 'draft' and `vendor_id` = 9 and `bc_bookings`.`deleted_at` is null order by `id` desc limit 5

    public static function getTopCardsReport()
    {

        $res = [];
        $total_data = parent::selectRaw('sum(`total`) as total_price , sum( `total` - `total_before_fees` + `commission` - `vendor_service_fee_amount` ) AS total_earning ')->whereNotIn('status',static::$notAcceptedStatus)->first();
        $total_booking = parent::whereNotIn('status',static::$notAcceptedStatus)->count('id');
---
select sum(`total`) as total_price , sum( `total` - `total_before_fees` + `commission` - `vendor_service_fee_amount` ) AS total_earning  from `bc_bookings` where `status` not in ('draft', 'cancelled', 'unpaid') and `bc_bookings`.`deleted_at` is null limit 1
select count(`id`) as aggregate from `bc_bookings` where `status` not in ('draft', 'cancelled', 'unpaid') and `bc_bookings`.`deleted_at` is null

    public static function getTopCardsReportForVendor($user_id)
    {

        $res = [];
        $total_money = parent::selectRaw('sum( `total_before_fees` - `commission` + `vendor_service_fee_amount` ) AS total_price , sum( CASE WHEN `status` = "completed" THEN `total_before_fees` - `commission` + `vendor_service_fee_amount` ELSE NULL END ) AS total_earning')->whereNotIn('status',static::$notAcceptedStatus)->where("vendor_id", $user_id)->first();
        $total_booking = parent::whereNotIn('status',static::$notAcceptedStatus)->where("vendor_id", $user_id)->count('id');
---
select sum( `total_before_fees` - `commission` + `vendor_service_fee_amount` ) AS total_price , sum( CASE WHEN `status` = "completed" THEN `total_before_fees` - `commission` + `vendor_service_fee_amount` ELSE NULL END ) AS total_earning from `bc_bookings` where `status` not in ('draft', 'cancelled', 'unpaid') and `vendor_id` = 9 and `bc_bookings`.`deleted_at` is null limit 1
select count(`id`) as aggregate from `bc_bookings` where `status` not in ('draft', 'cancelled', 'unpaid') and `vendor_id` = 9 and `bc_bookings`.`deleted_at` is null