bc-cms/modules/Vendor/Controllers/ApiKeyPortalController.php

    public function index()
    {
        $keys    = VendorApiKey::where('vendor_id', Auth::id())->orderByDesc('created_at')->get();
        $origins = VendorAllowedOrigin::where('vendor_id', Auth::id())->get();
---
select * from `bc_vendor_api_keys` where `vendor_id` = 8 order by `created_at` desc
select * from `bc_vendor_allowed_origins` where `vendor_id` = 8

    public function storeOrigin(Request $request)
    {
        $request->validate([
            'origin' => ['required', 'string', 'max:255', 'regex:/^https:\/\/[a-z0-9\-\.]+(\:\d+)?$/i'],
        ]);

        $count = VendorAllowedOrigin::where('vendor_id', Auth::id())->count();
        if ($count >= 20) {
            return back()->with('error', 'Maximum 20 allowed origins per account.');
        }

        VendorAllowedOrigin::firstOrCreate([
            'vendor_id' => Auth::id(),
            'origin'    => rtrim($request->input('origin'), '/'),
        ]);
---
select count(*) as aggregate from `bc_vendor_allowed_origins` where `vendor_id` = 8
select * from `bc_vendor_allowed_origins` where (`vendor_id` = 8 and `origin` = 'https://dare2-travel.com') limit 1
insert into `bc_vendor_allowed_origins` (`vendor_id`, `origin`, `updated_at`, `created_at`) values (8, 'https://dare2-travel.com', '2026-05-30 21:40:45', '2026-05-30 21:40:45')