bc-cms/app/User.php

    public function getMeta($key, $default = '')
    {
        //if(isset($this->cachedMeta[$key])) return $this->cachedMeta[$key];

        $val = DB::table('user_meta')->where([
            'user_id' => $this->id,
            'name'    => $key
        ])->first();
---
select * from `user_meta` where (`user_id` = 6 and `name` = 'social_meta_avatar') limit 1