bc-cms/modules/User/Controllers/UserController.php

    public function vendorBookings(Request $request)
    {
        $userId = Auth::id();
        $query  = Booking::where('vendor_id', $userId)
            ->where('status', '!=', 'draft')
            ->whereIn('object_model', array_merge(array_keys(get_bookable_services()), ['tanova_trip']));

        if ($s = $request->get('s')) {
            if (is_numeric($s)) {
                $query->where('id', $s);
            } else {
                $query->where(function ($q) use ($s) {
                    $q->where('first_name', 'like', "%{$s}%")
                      ->orWhere('last_name',  'like', "%{$s}%")
                      ->orWhere('email',       'like', "%{$s}%")
                      ->orWhere('phone',       'like', "%{$s}%");
                });
            }
        }

        if ($status = $request->get('status')) {
            $query->where('status', $status);
        }

        $query->orderBy('id', 'desc');

        $totalRev   = (clone $query)->sum('total');
        $totalPaid  = (clone $query)->sum('paid');
        $processing = (clone $query)->where('status', 'processing')->count();

        return view('User::frontend.vendorBookings', [
            'rows'        => $query->paginate(20),
            'total_rev'   => $totalRev,
            'total_paid'  => $totalPaid,
            'processing'  => $processing,
            'statuses'    => config('booking.statuses'),
            'page_title'  => __('Bookings'),
        ]);
---
select sum(`total`) as aggregate from `bc_bookings` where `vendor_id` = 9 and `status` != 'draft' and `object_model` in ('hotel', 'space', 'car', 'event', 'tour', 'flight', 'boat', 'visa', 'tanova_trip', 'tanova_trip') and `bc_bookings`.`deleted_at` is null
select sum(`paid`) as aggregate from `bc_bookings` where `vendor_id` = 9 and `status` != 'draft' and `object_model` in ('hotel', 'space', 'car', 'event', 'tour', 'flight', 'boat', 'visa', 'tanova_trip', 'tanova_trip') and `bc_bookings`.`deleted_at` is null
select count(*) as aggregate from `bc_bookings` where `vendor_id` = 9 and `status` != 'draft' and `object_model` in ('hotel', 'space', 'car', 'event', 'tour', 'flight', 'boat', 'visa', 'tanova_trip', 'tanova_trip') and `status` = 'processing' and `bc_bookings`.`deleted_at` is null
select * from `bc_bookings` where `vendor_id` = 9 and `status` != 'draft' and `object_model` in ('hotel', 'space', 'car', 'event', 'tour', 'flight', 'boat', 'visa', 'tanova_trip', 'tanova_trip') and `bc_bookings`.`deleted_at` is null order by `id` desc limit 20 offset 0
select count(*) as aggregate from `bc_bookings` where `vendor_id` = 9 and `status` != 'draft' and `object_model` in ('hotel', 'space', 'car', 'event', 'tour', 'flight', 'boat', 'visa', 'tanova_trip', 'tanova_trip') and `bc_bookings`.`deleted_at` is null