bc-cms/modules/Hotel/Controllers/VendorController.php

    public function create(Request $request)
    {
        $this->checkPermission('hotel_create');
        $row = new $this->hotelClass();
        $data = [
            'row'           => $row,
            'translation' => new $this->hotelTranslationClass(),
            'hotel_location' => $this->locationClass::where("status","publish")->get()->toTree(),
            'location_category' => $this->locationCategoryClass::where('status', 'publish')->get(),
            'attributes'    => $this->attributesClass::where('service', 'hotel')->get(),
---
select * from `bc_locations` where `status` = 'publish' and `bc_locations`.`deleted_at` is null
select * from `location_category` where `status` = 'publish' and `location_category`.`deleted_at` is null
select * from `bc_attrs` where `service` = 'hotel' and `bc_attrs`.`deleted_at` is null