bc-cms/pro/Concierge/Controllers/ConciergeAdminController.php

select * from `bc_concierge_conversations` where `vendor_id` = 9 and `bc_concierge_conversations`.`deleted_at` is null order by `last_message_at` desc limit 25 offset 0
select count(*) as aggregate from `bc_concierge_conversations` where `vendor_id` = 9 and `bc_concierge_conversations`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $query = ConciergeConversation::with('latestMessage')
            ->where('vendor_id', auth()->id())
            ->latest('last_message_at');

        if ($status = $request->get('status')) {
            $query->where('status', $status);
        }
        if ($channel = $request->get('channel')) {
            $query->where('channel', $channel);
        }
        if ($search = $request->get('s')) {
            $query->where(function ($q) use ($search) {
                $q->where('guest_name', 'like', "%{$search}%")
                  ->orWhere('guest_email', 'like', "%{$search}%");
            });
        }

        $conversations = $query->paginate(25);